<?
    $head_dis=array();
    $head_dis[0]="голову";
    $head_dis[1]="темечко";
    $head_dis[2]="чайник";
    $head_dis[3]="ухо";
    $head_dis[4]="левый глаз";
    $head_dis[5]="зубы";
    $head_dis[6]="нос";
    $head_dis[7]="плоский лоб";

    $arm_dis = array();
    $arm_dis[0]="руку";
    $arm_dis[1]="правую руку";
    $arm_dis[2]="левую руку";
    $arm_dis[3]="локоть";
    $arm_dis[4]="бицепс";

    $corp_dis=array();
    $corp_dis[0]="корпус";
    $corp_dis[1]="грудь";
    $corp_dis[2]="плечо";
    $corp_dis[3]="ключицу";
    $corp_dis[4]="солнечное сплетение";
    $corp_dis[5]="волосатую грудь";

    $jivot=array();
    $jivot_dis[0]="живот";
    $jivot_dis[1]="чуть выше пояса";
    $jivot_dis[2]="почку";
    $jivot_dis[3]="пупок";

    $poyas_dis=array();
    $poyas_dis[0]="пояс";
    $poyas_dis[1]="эрогенную зону";
    $poyas_dis[2]="пупок";
    $poyas_dis[3]="укромное место";
    $poyas_dis[4]="гениталии";
    $poyas_dis[5]="то место, в которое обычно не бьют";

    $leg_dis=array();
    $leg_dis[0]="ноги";
    $leg_dis[1]="колено";
    $leg_dis[2]="пятку";
    $leg_dis[3]="щиколотку";
    $leg_dis[4]="левую ногу";
    $leg_dis[5]="мизинец ноги";

    $crit_dis_1=array();
    $crit_dis_1[0]="смотрел$pref_d в облака, а в это время";
    $crit_dis_1[1]="думал$pref_d о горячем ужине, но прервав его мечтания";
    $crit_dis_1[2]="смотрел$pref_d на прохожего, и воспользовавшись моментом,";
    $crit_dis_1[3]="глядел$pref_d куда-то в небо, а в это время";
    $crit_dis_1[4]="думал$pref_d о теплой ванне, но";
    $crit_dis_1[5]="почесал$pref_d за ухом и увидев это";

    $crit_dis_2=array();
    $crit_dis_2[0]="провел$pref безумный удар в";
    $crit_dis_2[1]="с хрустом ударил$pref в";
    $crit_dis_2[2]="лихо подпрыгнув пнул$pref в";
    $crit_dis_2[3]="крикнув 'Алах-Акбар!!!' молниеносно укусил$pref за";
    $crit_dis_2[4]="напугав всех в округе, стукнул$pref в";
    $crit_dis_2[5]="удивив народ глубокими познаниями карате шлепнул$pref в";

    $uv_dis_1=array();
    $uv_dis_1[0]="хотел$pref_d ударить в";
    $uv_dis_1[1]="задумал$pref_d ударить в";
    $uv_dis_1[2]="мечтал$pref_d стукнуть в";

    $uv_dis_2=array();
    $uv_dis_2[0]="но";
    $uv_dis_2[1]="когда";

    $uv_dis_3=array();
    $uv_dis_3[0]="отпрыгнул$pref_d от удара";
    $uv_dis_1[1]="отскочил$pref_d от удара";
?>