<?
defined('AntiBK') or die ("Доступ запрещен!");

$data['colors'] = array (
  'black'     => 'Черный',
  'blue'      => 'Синий',
  'fuchsia'   => 'Розовый',
  'grey'      => 'Коричневый',
  'green'     => 'Зеленый',
  'maroon'    => 'Малиновый',
  'navy'      => 'Морской',
  'olive'     => 'Оливковый',
  'purple'    => 'Фиолетовый',
  'teal'      => 'Темно-зеленый',
  'orange'    => 'Оранжевый',
  'chocolate' => 'Шоколадный',
  'darkkhaki' => 'Темно-желтый',
  'sandybrown'=> 'Темно-оранжевый'
);

$data['month'] = array (
  '01' => 'Январь',
  '02' => 'Февраль',
  '03' => 'Март',
  '04' => 'Апрель',
  '05' => 'Май',
  '06' => 'Июнь',
  '07' => 'Июль',
  '08' => 'Август',
  '09' => 'Сентябрь',
  '10' => 'Октябрь',
  '11' => 'Ноябрь',
  '12' => 'Декабрь'
);

$data['towns'] = array (
  'Москва', 'Санкт-Петербург', 'Абакан (Хакасия)', 'Азов', 'Аксай (Ростовская обл.)', 'Алания', 'Альметьевск', 'Амурск', 'Анадырь', 'Анапа', 'Ангарск (Иркутская обл.)',
  'Апатиты', 'Армавир', 'Архангельск', 'Асбест', 'Астрахань', 'Балашиха', 'Барнаул', 'Белгород', 'Беломорск (Карелия)', 'Березники (Пермская обл.)', 'Бийск',
  'Биробиджан', 'Благовещенск', 'Большой камень', 'Борисоглебск', 'Братск', 'Бронницы', 'Брянск', 'Ванино', 'Великие Луки', 'Великий Устюг', 'Верхняя Салда',
  'Владивосток', 'Владикавказ', 'Владимир', 'Волгоград', 'Волгодонск', 'Волжск', 'Вологда', 'Волхов (С.Птрбрг обл.)', 'Воронеж', 'Воскресенск', 'Воткинск', 'Выборг',
  'Вязьма (Смоленская обл.)', 'Вятские Поляны', 'Гаврилов-Ям', 'Геленджик', 'Георгиевск', 'Голицино (Московская обл.)', 'Губкин', 'Гусь-Хрустальный',
  'Дзержинск (Нижгрдск обл.)', 'Димитровград', 'Долгопрудный', 'Дубна', 'Дудинка (Эвенкская АО)', 'Ейск', 'Екатеринбург', 'Елабуга (Татарстан)', 'Елец (Липецкая обл.)',
  'Елизово', 'Железногорск', 'Жуков (Калужской обл.)', 'Жуковский', 'Заречный', 'Звенигород', 'Зеленогорск', 'Зеленоград', 'Зеленодольск', 'Златоуст', 'Иваново',
  'Ивантеевка (Мсквск обл.)', 'Ижевск', 'Иркутск', 'Ишим', 'Йошкар-Ола', 'Казань', 'Калининград', 'Калуга', 'Каменск-Уральский', 'Карталы', 'Кемерово',
  'Кинешма (Ивановская обл.)', 'Кириши ( С.Птрбрг обл.)', 'Киров', 'Кирово-Чепецк', 'Кисловодск', 'Ковров', 'Когалым', 'Коломна', 'Комсомольск-на-Амуре', 'Королев',
  'Костомукша', 'Кострома', 'Красногорск', 'Краснодар', 'Красноярск', 'Кронштадт', 'Кропоткин', 'Кумертау (Башкортостан)', 'Курган', 'Курск', 'Кустанай', 'Кызыл',
  'Липецк', 'Лыткарино (Московская обл.)', 'Люберцы', 'Магадан', 'Магнитогорск', 'Майкоп', 'Малоярославец', 'Махачкала', 'Медвежьегорск', 'Междуреченск (Кмрвск обл.)',
  'Менделеевск', 'Миасс', 'Миллерово (Ростовская обл.)', 'Минеральные Воды', 'Мичуринск (Тамбовская обл.)', 'Мурманск', 'Муром', 'Мытищи', 'Набережные Челны', 'Надым',
  'Нальчик', 'Находка', 'Невинномысск', 'Нефтекамск', 'Нефтеюганск', 'Нижневартовс', 'Нижнекамск', 'Нижний Новгород', 'Нижний Тагил', 'Николаевск-на-Амуре',
  'Николаевск', 'Новгород', 'Новокузнецк', 'Новомосковск', 'Новороссийск', 'Новосибирск', 'Новоуральск', 'Новочеркасск', 'Новый Уренгой', 'Норильск', 'Ноябрьск',
  'Нягань', 'Обнинск', 'Одинцово', 'Омск', 'Онега', 'Орел', 'Оренбург', 'Орск', 'Пенза', 'Первоуральск', 'Переславль-Залесский', 'Пермь', 'Петрозаводск',
  'Петропавловск-Камч.', 'Пластун (Приморский край)', 'Подольск', 'Полевской', 'Полярные Зори', 'Протвино', 'Псков', 'Пущино', 'Пятигорск', 'Радужный (Тюменская обл.)',
  'Ревда', 'Ржев', 'Ростов-на-Дону', 'Ростов-Ярославский', 'Рубцовск', 'Рязань', 'Салехард', 'Самара', 'Саранск', 'Саратов', 'Саров', 'Сасово', 'Себеж (Псковская обл.)',
  'Северодвинск', 'Северск (Томская обл.)', 'Сегежа', 'Семикаракорск', 'Сергиев Посад', 'Серов', 'Серпухов', 'Сестрорецк (С.Птрбрг обл.)', 'Смоленск', 'Снежинск',
  'Советская Гавань', 'Советский (Тюменская обл.)', 'Солнечногорск', 'Сосновый Бор', 'Сосновый Бор (С.Птрбрг обл.)', 'Сочи', 'Ставрополь', 'Старая Русса',
  'Старый Оскол', 'Стерлитамак (Башкортостан)', 'Стрежевой (Томская обл.)', 'Строгино', 'Сургут', 'Сызрань', 'Сыктывкар', 'Таганрог', 'Тамбов', 'Таруса', 'Тверь',
  'Тольятти', 'Томск', 'Трехгорный', 'Троицк', 'Туапсе', 'Тула', 'Тюмень', 'Удомля (Тверская обл.)', 'Улан-Удэ', 'Ульяновск', 'Уссурийск', 'Усть-Лабинск (Крсндрскй край)',
  'Уфа', 'Ухта', 'Фрязино', 'Хабаровск', 'Ханты-Мансийск', 'Химки', 'Холмск', 'Чебаркуль', 'Чебоксары', 'Челябинск', 'Череповец', 'Черкесск', 'Черноголовка',
  'Чернушка (Пермская обл.)', 'Черняховск (Клннгрдск обл.)', 'Чита', 'Шадринск (Курганская обл.)', 'Шатура', 'Шахты', 'Щелково (Московская обл.)', 'Электросталь',
  'Элиста', 'Энгельс', 'Южно-Сахалинск', 'Южноуральск', 'Юрга', 'Якутск', 'Ярославль', 'Азербайджан', 'Армения', 'Беларусь', 'Грузия', 'Казахстан', 'Кыргызстан',
  'Латвия', 'Литва', 'Таджикистан', 'Туркменистан', 'Узбекистан', 'Украина', 'Эстония', 'Германия/Germany', 'Израиль/Israel', 'Канада/Canada', 'США/USA',
);

$data['shop_flags'] = array (
  'cap'  => 1,
  'drm'  => 2,
  'low'  => 4,
  'old'  => 8,
  'ang'  => 16,
  'dem'  => 32,
  'dev'  => 64,
  'sun'  => 128,
  'em'   => 256,
  'sand' => 512,
  'moon' => 1024,
  'nc'   => 2048,
  'ap'   => 4096
);

$data['item_flags'] = array (
  1  => 'Sellable',
  2  => 'Repairable',
  4  => 'Artefact',
  8  => 'Personal',
  16 => 'Left Hand'
);

$data['sections'] = array (
  1 => 'item',
  2 => 'thing',
  3 => 'elix',
  4 => 'other'
);

$data['sections_shop'] = array (
  'sell'        => array ('',     'NULL',        'shop_sell'),
  'knife'       => array ('shop', 'shop_weapon', 'shop_weapon'),
  'axe'         => array ('shop', 'shop_weapon', 'whitespace'),
  'fail'        => array ('shop', 'shop_weapon', 'whitespace'),
  'sword'       => array ('shop', 'shop_weapon', 'whitespace'),
  'staff'       => array ('shop', 'shop_weapon', 'whitespace'),
  'boots'       => array ('shop', 'shop_dress',  'shop_dress'),
  'shirt'       => array ('shop', 'shop_dress',  'whitespace'),
  'gloves'      => array ('shop', 'shop_dress',  'whitespace'),
  'light_armor' => array ('shop', 'shop_dress',  'whitespace'),
  'heavy_armor' => array ('shop', 'shop_dress',  'whitespace'),
  'helmet'      => array ('shop', 'shop_dress',  'whitespace'),
  'bracer'      => array ('shop', 'shop_dress',  'whitespace'),
  'belt'        => array ('shop', 'shop_dress',  'whitespace'),
  'pants'       => array ('shop', 'shop_dress',  'whitespace'),
  'shield'      => array ('shop', 'NULL',        'NULL'),
  'earring'     => array ('shop', 'shop_jewel',  'shop_jewel'),
  'amulet'      => array ('shop', 'shop_jewel',  'whitespace'),
  'ring'        => array ('shop', 'shop_jewel',  'whitespace'),
  'scroll'      => array ('shop', 'NULL',        'NULL')
);

$behaviour = array (
//Хар-ка  |Мин.лвл
  'str' => 0,
  'dex' => 0,
  'con' => 0,
  'vit' => 0,
  'int' => 4,
  'wis' => 6,
  'spi' => 10
);
$mastery = array (
  'phisic' => 0,
  'sword'  => 0,
  'fail'   => 0,
  'staff'  => 0,
  'knife'  => 0,
  'axe'    => 0,
  'fire'   => 4,
  'water'  => 4,
  'air'    => 4,
  'earth'  => 4,
  'light'  => 4,
  'gray'   => 4,
  'dark'   => 4
);

define ("DATE_FULL", date ('d.m.y H:i:s'));
define ("DATE_NO_SEC", date ('d.m.y H:i'));
define ("DATE_TIME", date ('H:i'));
?>